In [33]:
import pandas as pd
import numpy as np

In [75]:
df=pd.read_csv("income.csv",names=['name','Income'],skiprows=[0])

In [76]:
df

        name    Income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [41]:
df.describe()

             Income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [45]:
df.Income.quantile(0.25,interpolation="lower")

5000

In [47]:
df.Income.quantile(1)

10000000.0

In [49]:
df.Income.quantile(0.99)

9400479.999999994

In [51]:
percentile_99=df.Income.quantile(0.99)
percentile_99

9400479.999999994

In [55]:
df.Income>percentile_99

0    False
1    False
2    False
3    False
4    False
5    False
6     True
Name: Income, dtype: bool

In [56]:
df[df.Income>percentile_99]

        name    Income
6  Elon Musk  10000000

In [59]:
df_no_outlier=df[df.Income<=percentile_99]
df_no_outlier

    name  Income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [65]:
df['Income'].iloc[3]=np.NaN
df

        name      Income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [67]:
df.Income.mean()

1671666.6666666667

In [71]:
df_new=df.fillna(df.Income.mean())
df_new

        name        Income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [72]:
df_new=df.fillna(df.Income.median())
df_new

        name      Income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0